In [2]:
import pandas as pd

hr_data = pd.read_csv('D:/Python Files/EDA/Data_sets/HR Analytics.csv')
hr_data.head()

,Age,Attrition,BusinessTravel,Department,DistanceFromHome,Education,EducationField,EmployeeNumber,EnvironmentSatisfaction,Gender,...,NumCompaniesWorked,PercentSalaryHike,PerformanceRating,RelationshipSatisfaction,TotalWorkingYears,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,1,Travel_Rarely,Sales,1,2,Life Sciences,1,2,Female,...,8,11,3,1,8,1,6,4,0,5
1,49,0,Travel_Frequently,Research & Development,8,1,Life Sciences,2,3,Male,...,1,23,4,4,10,3,10,7,1,7
2,37,1,Travel_Rarely,Research & Development,2,2,Other,4,4,Male,...,6,15,3,2,7,3,0,0,0,0
3,33,0,Travel_Frequently,Research & Development,3,4,Life Sciences,5,4,Female,...,1,11,3,3,8,3,8,7,3,0
4,27,0,Travel_Rarely,Research & Development,2,1,Medical,7,1,Male,...,9,12,3,4,6,3,2,2,2,2

## 1. What proportion of our staff are leaving?

In [3]:
leaving = hr_data.groupby(['Attrition'])['EmployeeNumber'].count().reset_index()
leaving

   Attrition  EmployeeNumber
0          0            1233
1          1             237

In [4]:
#leaving[1]/(leaving[0]+leaving[1])*100

In [5]:
leaving_percentage = leaving.loc[1]['EmployeeNumber']/(leaving.loc[1]['EmployeeNumber']+leaving.loc[0]['EmployeeNumber'])*100
round(leaving_percentage,2)

16.12

## 2.	What role does gender and age play in this workplace?

In [6]:
age_gender = hr_data[['Gender','Attrition','Age','EmployeeNumber','Department','JobRole','MonthlyIncome']]
age_gender.head()

,Gender,Attrition,Age,EmployeeNumber,Department,JobRole,MonthlyIncome
0,Female,1,41,1,Sales,Sales Executive,5993
1,Male,0,49,2,Research & Development,Research Scientist,5130
2,Male,1,37,4,Research & Development,Laboratory Technician,2090
3,Female,0,33,5,Research & Development,Research Scientist,2909
4,Male,0,27,7,Research & Development,Laboratory Technician,3468

In [7]:
age_gender1 = age_gender.groupby(['Gender'])['MonthlyIncome'].mean().reset_index()
age_gender1

   Gender  MonthlyIncome
0  Female    6686.566327
1    Male    6380.507937

In [8]:
#hired personnel
age_gender2 = age_gender.groupby(['Gender'])['EmployeeNumber'].count().reset_index()
age_gender2

   Gender  EmployeeNumber
0  Female             588
1    Male             882

In [9]:
# leaving gender wise categorization
age_gender2 = age_gender.groupby(['Gender','Attrition'])['EmployeeNumber'].count().reset_index()
age_gender2

   Gender  Attrition  EmployeeNumber
0  Female          0             501
1  Female          1              87
2    Male          0             732
3    Male          1             150

In [10]:
male_leaving_pctg = (150/732)*100
print(male_leaving_pctg)

20.491803278688526

In [11]:
female_leaving_pctg = (87/501)*100
print(female_leaving_pctg)

17.365269461077844

In [12]:
# department wise count

age_gender3 = age_gender.groupby(['Gender','Department'])['EmployeeNumber'].count().reset_index()
age_gender3

   Gender              Department  EmployeeNumber
0  Female         Human Resources              20
1  Female  Research & Development             379
2  Female                   Sales             189
3    Male         Human Resources              43
4    Male  Research & Development             582
5    Male                   Sales             257

In [13]:
# gender-wise distribution in departments
age_gender_pivot = age_gender3.pivot('Department','Gender','EmployeeNumber')
age_gender_pivot

Gender                  Female  Male
Department
Human Resources             20    43
Research & Development     379   582
Sales                      189   257

In [14]:
# femae leaving due to distance
leaving = hr_data[(hr_data['Attrition'] == 1) & (hr_data['Gender'] == 'Female') & (hr_data['DistanceFromHome'] >= 5)]
print(leaving.shape)
females_leaving_due_to_distance = round((62/87)*100,2)
females_leaving_due_to_distance

(62, 25)

71.26

In [15]:
# females leaving due to duration of greater than or equal to 2 years since last promaotion

leaving = hr_data[(hr_data['Attrition'] == 1) & (hr_data['Gender'] == 'Female') & (hr_data['YearsSinceLastPromotion'] >= 2)]
leaving.shape

(28, 25)

In [16]:
# leaving due to income less than 4500 per month

leaving = hr_data[(hr_data['Attrition'] == 1) & ((hr_data['Gender'] == 'Female') | (hr_data['Gender'] == 'Male')) & (hr_data['MonthlyIncome'] <=4500)]
leaving.shape

(147, 25)

In [69]:
# age wise attrition count

age_wise = pd.DataFrame(hr_data.groupby(['Age'])['Attrition'].sum())
age_wise = age_wise.rename(columns = {'Attrition':'Freq'})
age_wise = age_wise.reset_index()
age_wise

    Age  Freq
0    18     4
1    19     6
2    20     6
3    21     6
4    22     5
5    23     4
6    24     7
7    25     6
8    26    12
9    27     3
10   28    14
11   29    18
12   30     9
13   31    18
14   32    11
15   33    12
16   34     9
17   35    10
18   36     6
19   37     6
20   38     2
21   39     6
22   40     5
23   41     6
24   42     2
25   43     2
26   44     6
27   45     2
28   46     4
29   47     3
30   48     2
31   49     2
32   50     5
33   51     2
34   52     3
35   53     2
36   54     0
37   55     3
38   56     3
39   57     0
40   58     5
41   59     0
42   60     0

In [74]:
import numpy as np
age_val = np.array(age_wise['Age'])
age_val

array([18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60], dtype=int64)

In [76]:
pd.cut(age_val, 3, retbins = True)

([(17.958, 32.0], (17.958, 32.0], (17.958, 32.0], (17.958, 32.0], (17.958, 32.0], ..., (46.0, 60.0], (46.0, 60.0], (46.0, 60.0], (46.0, 60.0], (46.0, 60.0]]
 Length: 43
 Categories (3, interval[float64]): [(17.958, 32.0] < (32.0, 46.0] < (46.0, 60.0]],
 array([17.958, 32.   , 46.   , 60.   ]))

## 3.	How much does income matter?

In [97]:
# mean income of people leaving and staying with the company
ab = hr_data.groupby(['Attrition'])['MonthlyIncome'].mean()
ab

Attrition
0    6832.739659
1    4787.092827
Name: MonthlyIncome, dtype: float64

In [98]:
cd = hr_data.groupby(['JobSatisfaction'])['MonthlyIncome'].mean()
cd

JobSatisfaction
1    6561.570934
2    6527.328571
3    6480.495475
4    6472.732026
Name: MonthlyIncome, dtype: float64